from pprint import pprint

data, d = [input().split(";") for _ in range(int(input()))], {}
for line in data:
    t1, t2 = line[0], line[2]
    t1_score = 3 if int(line[1]) > int(line[3]) else 1 if int(line[1]) == int(line[3]) else 0
    t2_score = 3 if int(line[1]) < int(line[3]) else 1 if int(line[1]) == int(line[3]) else 0
    if t1 not in d:
        d[t1] = [0] * 5
    if t2 not in d:
        d[t2] = [0] * 5
    d[t1] = [d[t1][0] + 1, d[t1][1] + (t1_score == 3), d[t1][2] + (t1_score == 1), d[t1][3] + (t1_score == 0),
             d[t1][4] + t1_score]
    d[t2] = [d[t2][0] + 1, d[t2][1] + (t2_score == 3), d[t2][2] + (t2_score == 1), d[t2][3] + (t2_score == 0),
             d[t2][4] + t2_score]
for k, v in d.items():
    print(k, end=":")
    print(*v)

'''Напишите программу, которая принимает на стандартный вход список игр футбольных команд с результатом матча и выводит
 на стандартный вывод сводную таблицу результатов всех матчей.

За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.

Формат ввода следующий:
В первой строке указано целое число n — количество завершенных игр.
После этого идет n строк, в которых записаны результаты игры в следующем формате:
Первая_команда;Забито_первой_командой;Вторая_команда;Забито_второй_командой

Вывод программы необходимо оформить следующим образом:
Команда:Всего_игр Побед Ничьих Поражений Всего_очков

Конкретный пример ввода-вывода приведён ниже.

Порядок вывода команд произвольный.

Sample Input:

3
Зенит;3;Спартак;1
Спартак;1;ЦСКА;1
ЦСКА;0;Зенит;2
Sample Output:

Зенит:2 2 0 0 6
ЦСКА:2 0 1 1 1
Спартак:2 0 1 1 1'''
